# Reshaping Pandas DataFrame

## Importing required packages

Importing packages needed for this notebook with an alias. We use alias so as to avoid typing name of package multiple times as we use it.

In [1]:
import pandas as pd
import numpy as np

Checking pandas version installed in the system

In [2]:
pd.__version__

'1.0.3'

Dataframes are very similar to excel tables, and sometimes we might want to look at them in different view/style. Like exchanging columns to rows and vice versa. Let us look at some of the famous reshaping functions available for dataframe.

I like to think of reshaping functions in two types. First type of functions simple reform the existing dataframe. For example, they change columns to rows and rows to columns. The second type of functions would aggregate the information along with reforming them. In most of the real world cases, we would be using the second type of functions as it would give us a peek into the higher level summaries or aggregation as needed.

## Type - 1 : Reforming without aggregation

Reforming without aggregation can and should ideally be applied on data where there is a unique combination of selections being made. Otherwise, there is a good chance that they would throw an error for certain functions.

To explain the reforming without aggregation, we would first declare a dataframe. The declaration and the dataframe would be as follows:

In [3]:
np.random.seed(100)
df=pd.DataFrame({"Date":pd.Index(pd.date_range(start='2/2/2019',periods=3)).repeat(3),
             "Class":["1A","2B","3C","1A","2B","3C","1A","2B","3C"],
             "Numbers":np.random.randn(9)})

df['Numbers2'] = df['Numbers'] * 2

df

        Date Class   Numbers  Numbers2
0 2019-02-02    1A -1.749765 -3.499531
1 2019-02-02    2B  0.342680  0.685361
2 2019-02-02    3C  1.153036  2.306072
3 2019-02-03    1A -0.252436 -0.504872
4 2019-02-03    2B  0.981321  1.962642
5 2019-02-03    3C  0.514219  1.028438
6 2019-02-04    1A  0.221180  0.442359
7 2019-02-04    2B -1.070043 -2.140087
8 2019-02-04    3C -0.189496 -0.378992

### Pivot

Pivot method is typically used to create a pivot style view of data where the users can specify rows (in python it is called index) and columns. These two parameters would give a structure to the view whereas the information to be populated would be from the data that is being used to create pivot. The information can also be selectively populated by using values parameter.

In [4]:
df.pivot(index='Date', columns='Class', values='Numbers')

Class             1A        2B        3C
Date
2019-02-02 -1.749765  0.342680  1.153036
2019-02-03 -0.252436  0.981321  0.514219
2019-02-04  0.221180 -1.070043 -0.189496

In [5]:
df.pivot(index='Date', columns='Class')

             Numbers                      Numbers2
Class             1A        2B        3C        1A        2B        3C
Date
2019-02-02 -1.749765  0.342680  1.153036 -3.499531  0.685361  2.306072
2019-02-03 -0.252436  0.981321  0.514219 -0.504872  1.962642  1.028438
2019-02-04  0.221180 -1.070043 -0.189496  0.442359 -2.140087 -0.378992

In [6]:
df.pivot(index='Date', columns='Class')['Numbers']

Class             1A        2B        3C
Date
2019-02-02 -1.749765  0.342680  1.153036
2019-02-03 -0.252436  0.981321  0.514219
2019-02-04  0.221180 -1.070043 -0.189496

In [7]:
df.pivot(index='Date', columns='Class')['Numbers'].reset_index()

Class       Date        1A        2B        3C
0     2019-02-02 -1.749765  0.342680  1.153036
1     2019-02-03 -0.252436  0.981321  0.514219
2     2019-02-04  0.221180 -1.070043 -0.189496

In [8]:
np.random.seed(100)
df1=pd.DataFrame({"Date":pd.Index(pd.date_range(start='2/2/2019',periods=3)).repeat(3),
             "Class":["1A","1A","1A","2B","2B","2B","3C","3C","3C"],
             "Numbers":np.random.randn(9)})

df1

        Date Class   Numbers
0 2019-02-02    1A -1.749765
1 2019-02-02    1A  0.342680
2 2019-02-02    1A  1.153036
3 2019-02-03    2B -0.252436
4 2019-02-03    2B  0.981321
5 2019-02-03    2B  0.514219
6 2019-02-04    3C  0.221180
7 2019-02-04    3C -1.070043
8 2019-02-04    3C -0.189496

In [9]:
df1.pivot(index='Date', columns='Class')

ValueError: Index contains duplicate entries, cannot reshape

### Melt

Melt is a function which is used to convert columns to rows. That means that this function is useful for when the users would like to bring one or more columns information into rows. This function would create two new columns by removing all other columns apart from the ones mentioned in its id_vars parameter and displays the column name in one column and its value in another column.

In [10]:
df

        Date Class   Numbers  Numbers2
0 2019-02-02    1A -1.749765 -3.499531
1 2019-02-02    2B  0.342680  0.685361
2 2019-02-02    3C  1.153036  2.306072
3 2019-02-03    1A -0.252436 -0.504872
4 2019-02-03    2B  0.981321  1.962642
5 2019-02-03    3C  0.514219  1.028438
6 2019-02-04    1A  0.221180  0.442359
7 2019-02-04    2B -1.070043 -2.140087
8 2019-02-04    3C -0.189496 -0.378992

In [11]:
df.melt(id_vars=['Date','Class'])

         Date Class  variable     value
0  2019-02-02    1A   Numbers -1.749765
1  2019-02-02    2B   Numbers  0.342680
2  2019-02-02    3C   Numbers  1.153036
3  2019-02-03    1A   Numbers -0.252436
4  2019-02-03    2B   Numbers  0.981321
5  2019-02-03    3C   Numbers  0.514219
6  2019-02-04    1A   Numbers  0.221180
7  2019-02-04    2B   Numbers -1.070043
8  2019-02-04    3C   Numbers -0.189496
9  2019-02-02    1A  Numbers2 -3.499531
10 2019-02-02    2B  Numbers2  0.685361
11 2019-02-02    3C  Numbers2  2.306072
12 2019-02-03    1A  Numbers2 -0.504872
13 2019-02-03    2B  Numbers2  1.962642
14 2019-02-03    3C  Numbers2  1.028438
15 2019-02-04    1A  Numbers2  0.442359
16 2019-02-04    2B  Numbers2 -2.140087
17 2019-02-04    3C  Numbers2 -0.378992

In [12]:
df.melt(id_vars=['Date','Class'],value_vars=['Numbers'])

        Date Class variable     value
0 2019-02-02    1A  Numbers -1.749765
1 2019-02-02    2B  Numbers  0.342680
2 2019-02-02    3C  Numbers  1.153036
3 2019-02-03    1A  Numbers -0.252436
4 2019-02-03    2B  Numbers  0.981321
5 2019-02-03    3C  Numbers  0.514219
6 2019-02-04    1A  Numbers  0.221180
7 2019-02-04    2B  Numbers -1.070043
8 2019-02-04    3C  Numbers -0.189496

In [13]:
df.melt(id_vars=['Date','Class'],value_vars=['Numbers'],value_name="Numbers_Value",var_name="Num_Var")

        Date Class  Num_Var  Numbers_Value
0 2019-02-02    1A  Numbers      -1.749765
1 2019-02-02    2B  Numbers       0.342680
2 2019-02-02    3C  Numbers       1.153036
3 2019-02-03    1A  Numbers      -0.252436
4 2019-02-03    2B  Numbers       0.981321
5 2019-02-03    3C  Numbers       0.514219
6 2019-02-04    1A  Numbers       0.221180
7 2019-02-04    2B  Numbers      -1.070043
8 2019-02-04    3C  Numbers      -0.189496

In [14]:
df1

        Date Class   Numbers
0 2019-02-02    1A -1.749765
1 2019-02-02    1A  0.342680
2 2019-02-02    1A  1.153036
3 2019-02-03    2B -0.252436
4 2019-02-03    2B  0.981321
5 2019-02-03    2B  0.514219
6 2019-02-04    3C  0.221180
7 2019-02-04    3C -1.070043
8 2019-02-04    3C -0.189496

In [15]:
df1.melt(id_vars=['Date','Class'],value_vars=['Numbers'],value_name="Numbers_Value",var_name="Num_Var")

        Date Class  Num_Var  Numbers_Value
0 2019-02-02    1A  Numbers      -1.749765
1 2019-02-02    1A  Numbers       0.342680
2 2019-02-02    1A  Numbers       1.153036
3 2019-02-03    2B  Numbers      -0.252436
4 2019-02-03    2B  Numbers       0.981321
5 2019-02-03    2B  Numbers       0.514219
6 2019-02-04    3C  Numbers       0.221180
7 2019-02-04    3C  Numbers      -1.070043
8 2019-02-04    3C  Numbers      -0.189496

### Stack and Unstack

Stack and Unstack perform columns to rows and rows to columns operations respectively. Both these functions are definitely one of the less used functions of reshaping in pandas as one would use pivot to achieve the result they want most of the time and hence it would not be needed.

#### Stack

In [16]:
df

        Date Class   Numbers  Numbers2
0 2019-02-02    1A -1.749765 -3.499531
1 2019-02-02    2B  0.342680  0.685361
2 2019-02-02    3C  1.153036  2.306072
3 2019-02-03    1A -0.252436 -0.504872
4 2019-02-03    2B  0.981321  1.962642
5 2019-02-03    3C  0.514219  1.028438
6 2019-02-04    1A  0.221180  0.442359
7 2019-02-04    2B -1.070043 -2.140087
8 2019-02-04    3C -0.189496 -0.378992

In [17]:
df.set_index(["Date","Class"]).stack()

Date        Class
2019-02-02  1A     Numbers    -1.749765
                   Numbers2   -3.499531
            2B     Numbers     0.342680
                   Numbers2    0.685361
            3C     Numbers     1.153036
                   Numbers2    2.306072
2019-02-03  1A     Numbers    -0.252436
                   Numbers2   -0.504872
            2B     Numbers     0.981321
                   Numbers2    1.962642
            3C     Numbers     0.514219
                   Numbers2    1.028438
2019-02-04  1A     Numbers     0.221180
                   Numbers2    0.442359
            2B     Numbers    -1.070043
                   Numbers2   -2.140087
            3C     Numbers    -0.189496
                   Numbers2   -0.378992
dtype: float64

In [18]:
df.set_index(["Date","Class"]).stack(0)

Date        Class
2019-02-02  1A     Numbers    -1.749765
                   Numbers2   -3.499531
            2B     Numbers     0.342680
                   Numbers2    0.685361
            3C     Numbers     1.153036
                   Numbers2    2.306072
2019-02-03  1A     Numbers    -0.252436
                   Numbers2   -0.504872
            2B     Numbers     0.981321
                   Numbers2    1.962642
            3C     Numbers     0.514219
                   Numbers2    1.028438
2019-02-04  1A     Numbers     0.221180
                   Numbers2    0.442359
            2B     Numbers    -1.070043
                   Numbers2   -2.140087
            3C     Numbers    -0.189496
                   Numbers2   -0.378992
dtype: float64

In [19]:
df.set_index(["Date","Class"]).stack(-1)

Date        Class
2019-02-02  1A     Numbers    -1.749765
                   Numbers2   -3.499531
            2B     Numbers     0.342680
                   Numbers2    0.685361
            3C     Numbers     1.153036
                   Numbers2    2.306072
2019-02-03  1A     Numbers    -0.252436
                   Numbers2   -0.504872
            2B     Numbers     0.981321
                   Numbers2    1.962642
            3C     Numbers     0.514219
                   Numbers2    1.028438
2019-02-04  1A     Numbers     0.221180
                   Numbers2    0.442359
            2B     Numbers    -1.070043
                   Numbers2   -2.140087
            3C     Numbers    -0.189496
                   Numbers2   -0.378992
dtype: float64

#### Unstack

In [20]:
df.set_index(["Date","Class"]).stack().unstack()

                   Numbers  Numbers2
Date       Class
2019-02-02 1A    -1.749765 -3.499531
           2B     0.342680  0.685361
           3C     1.153036  2.306072
2019-02-03 1A    -0.252436 -0.504872
           2B     0.981321  1.962642
           3C     0.514219  1.028438
2019-02-04 1A     0.221180  0.442359
           2B    -1.070043 -2.140087
           3C    -0.189496 -0.378992

In [21]:
df.set_index(["Date","Class"]).stack().unstack(-1)

                   Numbers  Numbers2
Date       Class
2019-02-02 1A    -1.749765 -3.499531
           2B     0.342680  0.685361
           3C     1.153036  2.306072
2019-02-03 1A    -0.252436 -0.504872
           2B     0.981321  1.962642
           3C     0.514219  1.028438
2019-02-04 1A     0.221180  0.442359
           2B    -1.070043 -2.140087
           3C    -0.189496 -0.378992

In [22]:
df.set_index(["Date","Class"]).stack().unstack(0)

Date            2019-02-02  2019-02-03  2019-02-04
Class
1A    Numbers    -1.749765   -0.252436    0.221180
      Numbers2   -3.499531   -0.504872    0.442359
2B    Numbers     0.342680    0.981321   -1.070043
      Numbers2    0.685361    1.962642   -2.140087
3C    Numbers     1.153036    0.514219   -0.189496
      Numbers2    2.306072    1.028438   -0.378992

In [23]:
df.set_index(["Date","Class"]).stack().unstack(1)

Class                      1A        2B        3C
Date
2019-02-02 Numbers  -1.749765  0.342680  1.153036
           Numbers2 -3.499531  0.685361  2.306072
2019-02-03 Numbers  -0.252436  0.981321  0.514219
           Numbers2 -0.504872  1.962642  1.028438
2019-02-04 Numbers   0.221180 -1.070043 -0.189496
           Numbers2  0.442359 -2.140087 -0.378992

In [24]:
df.set_index(["Date","Class"]).stack().unstack([1,-1])

Class             1A                  2B                  3C
             Numbers  Numbers2   Numbers  Numbers2   Numbers  Numbers2
Date
2019-02-02 -1.749765 -3.499531  0.342680  0.685361  1.153036  2.306072
2019-02-03 -0.252436 -0.504872  0.981321  1.962642  0.514219  1.028438
2019-02-04  0.221180  0.442359 -1.070043 -2.140087 -0.189496 -0.378992

## Type - 2: Reforming with aggregation

Unlike the type-1 functions, type-2 functions give an aggregated view of information. These will be very useful in case the users would like to have some type of summary around the data. We will be using the same dataframe that we used for Type -1 functions to look into type -2 functions as well.

To explain the reforming without aggregation, we would first declare a dataframe. The declaration and the dataframe would be as follows:

In [25]:
df=pd.DataFrame({"Date":pd.Index(pd.date_range(start='2/2/2019',periods=2)).repeat(4),
             "Class":["1A","2B","3C","1A","2B","3C","1A","2B"],
             "Numbers":np.random.randn(8)})

df['Numbers2'] = df['Numbers'] * 2

df

        Date Class   Numbers  Numbers2
0 2019-02-02    1A  0.255001  0.510003
1 2019-02-02    2B -0.458027 -0.916054
2 2019-02-02    3C  0.435163  0.870327
3 2019-02-02    1A -0.583595 -1.167190
4 2019-02-03    2B  0.816847  1.633694
5 2019-02-03    3C  0.672721  1.345442
6 2019-02-03    1A -0.104411 -0.208822
7 2019-02-03    2B -0.531280 -1.062561

### Group By

Group by is the function that I use the more often than any other function mentioned in this article. This is because, it is very intuitive to use and has very useful parameters that can help one to view different aggregations for different columns.

In [26]:
df.groupby('Date')["Numbers"].mean()

Date
2019-02-02   -0.087864
2019-02-03    0.213469
Name: Numbers, dtype: float64

In [27]:
df.groupby('Date',as_index=False)["Numbers"].mean()

        Date   Numbers
0 2019-02-02 -0.087864
1 2019-02-03  0.213469

In [28]:
df.groupby(['Date','Class'],as_index=False)["Numbers"].mean()

        Date Class   Numbers
0 2019-02-02    1A -0.164297
1 2019-02-02    2B -0.458027
2 2019-02-02    3C  0.435163
3 2019-02-03    1A -0.104411
4 2019-02-03    2B  0.142783
5 2019-02-03    3C  0.672721

In [29]:
df.groupby(['Date','Class'],as_index=False)[["Numbers","Numbers2"]].mean()

        Date Class   Numbers  Numbers2
0 2019-02-02    1A -0.164297 -0.328594
1 2019-02-02    2B -0.458027 -0.916054
2 2019-02-02    3C  0.435163  0.870327
3 2019-02-03    1A -0.104411 -0.208822
4 2019-02-03    2B  0.142783  0.285567
5 2019-02-03    3C  0.672721  1.345442

In [30]:
df.groupby(['Date'],as_index=False).aggregate({"Numbers":"sum","Numbers2":"mean"})

        Date   Numbers  Numbers2
0 2019-02-02 -0.351457 -0.175729
1 2019-02-03  0.853876  0.426938

### Pivot Table

Pivot Table functions in the same way that pivots do. However, pivot table has one additional and significant argument/parameter which specifies the aggregation function we will be using to aggregate the data.

In [31]:
df.pivot(index="Date",columns="Class")

ValueError: Index contains duplicate entries, cannot reshape

In [32]:
df.pivot_table(index="Date",columns="Class")

             Numbers                      Numbers2
Class             1A        2B        3C        1A        2B        3C
Date
2019-02-02 -0.164297 -0.458027  0.435163 -0.328594 -0.916054  0.870327
2019-02-03 -0.104411  0.142783  0.672721 -0.208822  0.285567  1.345442

In [33]:
df.pivot_table(index="Date",columns="Class",aggfunc="sum")

             Numbers                      Numbers2
Class             1A        2B        3C        1A        2B        3C
Date
2019-02-02 -0.328594 -0.458027  0.435163 -0.657187 -0.916054  0.870327
2019-02-03 -0.104411  0.285567  0.672721 -0.208822  0.571133  1.345442

### Crosstab

The last function in this article would be crosstab. This function by default would give the count or frequency of occurrence between values of two different columns.

In [34]:
df

        Date Class   Numbers  Numbers2
0 2019-02-02    1A  0.255001  0.510003
1 2019-02-02    2B -0.458027 -0.916054
2 2019-02-02    3C  0.435163  0.870327
3 2019-02-02    1A -0.583595 -1.167190
4 2019-02-03    2B  0.816847  1.633694
5 2019-02-03    3C  0.672721  1.345442
6 2019-02-03    1A -0.104411 -0.208822
7 2019-02-03    2B -0.531280 -1.062561

In [35]:
pd.crosstab(df.Date,df.Class)

Class       1A  2B  3C
Date
2019-02-02   2   1   1
2019-02-03   1   2   1

In [36]:
pd.crosstab(df.Date,df.Class,values=df.Numbers,aggfunc='sum')

Class             1A        2B        3C
Date
2019-02-02 -0.328594 -0.458027  0.435163
2019-02-03 -0.104411  0.285567  0.672721

In [37]:
pd.crosstab(df.Date,df.Class,values=df.Numbers,aggfunc='mean')

Class             1A        2B        3C
Date
2019-02-02 -0.164297 -0.458027  0.435163
2019-02-03 -0.104411  0.142783  0.672721